app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    render json: @article.as_json
  end

  private def find_article
    @article = Article.find(params[:id])